PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2s.c
/*!
    \file    gd32f3x0_hal_i2s.c
    \brief   I2S driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

#if (defined(GD32F350) || defined(GD32F310))
#define I2S_INIT_MASK                   ((uint32_t)0x0000F047U)  /*!< I2S parameter initialization mask */
#define SPI_I2SPSC_RESET                ((uint32_t)0x00000002U)  /*!< default value of SPI_I2SPSC register */

/* I2S private function */
static void _i2s_deinit(uint32_t i2s_periph);
static void _i2s_transmit_complete_dma(void *dma);
static void _i2s_receive_complete_dma(void *dma);
static void _i2s_dma_error(void *dma);
static void _i2s_transmit_interrupt(void *i2s);
static void _i2s_receive_interrupt(void *i2s);
static FlagStatus _i2s_flag_get(uint32_t periph, uint32_t flag);
static FlagStatus _i2s_interrupt_flag_get(uint32_t periph, uint8_t interrupt);

/*!
    \brief      deinitialize I2S
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_deinit(hal_i2s_dev_struct *i2s)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(SPI0 == i2s->periph) {
        i2s->state = HAL_I2S_STATE_BUSY;
        /* reset I2S */
        _i2s_deinit(i2s->periph);
        hal_i2s_struct_init(HAL_I2S_DEV_STRUCT, i2s);
        i2s->state = HAL_I2S_STATE_READY;
    } else {
        HAL_DEBUGE("parameter [i2c->periph] value is invalid");
    }
}

/*!
    \brief      initialize the I2S structure
    \param[in]  hal_struct_type: refer to hal_i2s_struct_type_enum
    \param[in]  p_struct: point to I2S structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_i2s_struct_init(hal_i2s_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct) {
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_I2S_INIT_STRUCT:
        /* initialize I2S initialization structure with the default values */
        ((hal_i2s_init_struct *)p_struct)->mode        = I2S_MODE_MASTERTX ;
        ((hal_i2s_init_struct *)p_struct)->standard    = I2S_STD_MSB ;
        ((hal_i2s_init_struct *)p_struct)->frameformat = I2S_FRAMEFORMAT_DT32B_CH32B;
        ((hal_i2s_init_struct *)p_struct)->mckout      = I2S_MCKOUT_DISABLE;
        ((hal_i2s_init_struct *)p_struct)->audiosample = I2S_AUDIOSAMPLE_8K;
        ((hal_i2s_init_struct *)p_struct)->ckpl        = I2S_CKPL_HIGH;
        break;

    case HAL_I2S_DEV_STRUCT:
        /* initialize I2S device information structure with the default values */
        ((hal_i2s_dev_struct *)p_struct)->periph                   = SPI0;
        ((hal_i2s_dev_struct *)p_struct)->i2s_irq.error_handle     = NULL;
        ((hal_i2s_dev_struct *)p_struct)->i2s_irq.receive_handler  = NULL;
        ((hal_i2s_dev_struct *)p_struct)->i2s_irq.transmit_handler = NULL;
        ((hal_i2s_dev_struct *)p_struct)->p_dma_rx                 = NULL;
        ((hal_i2s_dev_struct *)p_struct)->p_dma_tx                 = NULL;
        ((hal_i2s_dev_struct *)p_struct)->rx_callback              = NULL;
        ((hal_i2s_dev_struct *)p_struct)->tx_callback              = NULL;
        ((hal_i2s_dev_struct *)p_struct)->error_callback           = NULL;
        ((hal_i2s_dev_struct *)p_struct)->txbuffer.buffer          = NULL;
        ((hal_i2s_dev_struct *)p_struct)->txbuffer.length          = 0U;
        ((hal_i2s_dev_struct *)p_struct)->txbuffer.pos             = 0U;
        ((hal_i2s_dev_struct *)p_struct)->rxbuffer.buffer          = NULL;
        ((hal_i2s_dev_struct *)p_struct)->rxbuffer.length          = 0U;
        ((hal_i2s_dev_struct *)p_struct)->rxbuffer.pos             = 0U;
        ((hal_i2s_dev_struct *)p_struct)->state                    = HAL_I2S_STATE_READY;
        ((hal_i2s_dev_struct *)p_struct)->error_code               = HAL_I2S_ERROR_NONE;
        ((hal_i2s_dev_struct *)p_struct)->mutex                    = HAL_MUTEX_UNLOCKED;
        break;

    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      initialize I2S
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which I2S is initialized
                    this parameter can only be I2S0 for gd32f3x0
    \param[in]  p_init: the initialization data needed to initialize I2S
                  mode: I2S_MODE_SLAVETX, I2S_MODE_SLAVERX, I2S_MODE_MASTERTX, I2S_MODE_MASTERRX
                  standard: the argument could be selected from enumeration <hal_i2s_standard_enum>
                  frameformat: I2S_FRAMEFORMAT_DT16B_CH16B, I2S_FRAMEFORMAT_DT16B_CH32B, I2S_FRAMEFORMAT_DT24B_CH32B, I2S_FRAMEFORMAT_DT32B_CH32B
                  mckout: I2S_MCKOUT_DISABLE, I2S_MCKOUT_ENABLE
                  audiosample: the argument could be selected from enumeration <hal_i2s_audiosample_enum>
                  ckpl:I2S_CKPL_LOW, I2S_CKPL_HIGH
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS,HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2s_init(hal_i2s_dev_struct *i2s, uint32_t periph, hal_i2s_init_struct *p_init)
{
    uint32_t reg = 0U;
    uint32_t i2sdiv = 2U, i2sof = 0U;
    uint32_t clks = 0U;
    uint32_t i2sclock = 0U;

