PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2s.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check I2S pointer and p_init address */
    if((NULL == i2s) && (NULL == p_init)) {
        return HAL_ERR_ADDRESS;
    }

    /* check periph parameter */
    if(SPI0 != periph) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    i2s->state = HAL_I2S_STATE_BUSY;
    i2s->periph = periph;
    /* disable the peripheral */
    __HAL_SPI_DISABLE(periph);

    /* init I2S */
    reg = SPI_I2SCTL(periph);
    reg &= I2S_INIT_MASK;

    /* enable I2S mode */
    reg |= (uint32_t)SPI_I2SCTL_I2SSEL;
    /* select I2S mode */
    reg |= (uint32_t)p_init->mode;
    /* select I2S standard */
    reg |= (uint32_t)p_init->standard;
    /* select I2S polarity */
    reg |= (uint32_t)p_init->ckpl;

    /* write to SPI_I2SCTL register */
    SPI_I2SCTL(periph) = (uint32_t)reg;

    /* configure I2S prescaler */
    /* deinitialize SPI_I2SPSC register */
    SPI_I2SPSC(periph) = SPI_I2SPSC_RESET;

    /* get system clock */
    i2sclock = hals_rcu_clock_freq_get(CK_SYS);

    /* configure the prescaler depending on the mclk output state, the frame format and audio sample rate */
    if(I2S_MCKOUT_ENABLE == p_init->mckout) {
        clks = (uint32_t)(((i2sclock / 256U) * 10U) / p_init->audiosample);
    } else {
        if(I2S_FRAMEFORMAT_DT16B_CH16B == p_init->frameformat) {
            clks = (uint32_t)(((i2sclock / 32U) * 10U) / p_init->audiosample);
        } else {
            clks = (uint32_t)(((i2sclock / 64U) * 10U) / p_init->audiosample);
        }
    }

    /* remove the floating point */
    clks = (clks + 5U) / 10U;
    i2sof = (clks & 0x00000001U);
    i2sdiv = ((clks - i2sof) / 2U);
    i2sof  = (i2sof << 8U);

    /* set the default values */
    if((i2sdiv < 2U) || (i2sdiv > 255U)) {
        i2sdiv = 2U;
        i2sof = 0U;
    }

    /* configure SPI_I2SPSC */
    SPI_I2SPSC(periph) = (uint32_t)(i2sdiv | i2sof | p_init->mckout);

    /* clear SPI_I2SCTL_DTLEN and SPI_I2SCTL_CHLEN bits */
    SPI_I2SCTL(periph) &= (uint32_t)(~(SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));
    /* configure data frame format */
    SPI_I2SCTL(periph) |= (uint32_t)p_init->frameformat;

    i2s->state = HAL_I2S_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data, poll transmit process and completed status, the function is blocking
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2s_transmit_poll(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, uint32_t timeout_ms)
{
    __IO uint32_t tmp = 0x0U;
    uint32_t tmp1 = 0U;
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check input parameter */
    if((NULL == i2s) || (NULL == p_buffer) || (0U == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock I2S */
    HAL_LOCK(i2s);

    if(HAL_I2S_STATE_READY == i2s->state) {
        tmp1 = SPI_I2SCTL(i2s->periph) & ((SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));
        /* check I2S frameformat */
        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)) {
            i2s->txbuffer.length = (length << 1U);
            i2s->txbuffer.pos = (length << 1U);
        } else {
            i2s->txbuffer.length = length;
            i2s->txbuffer.pos = length;
        }

        i2s->error_code = HAL_I2S_ERROR_NONE;
        i2s->state = HAL_I2S_STATE_BUSY_TX;

        /* enable I2S peripheral */
        __HAL_I2S_ENABLE(i2s->periph);

        /* transmit data */
        while(i2s->txbuffer.pos > 0U) {
            SPI_DATA(i2s->periph) = (*p_buffer++);
            i2s->txbuffer.pos--;

            /* wait TBE flag is set */
            tick_start = hal_sys_basetick_count_get();
            while(RESET == _i2s_flag_get(i2s->periph, I2S_FLAG_TBE)) {
                if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }
            if(SET == _i2s_flag_get(i2s->periph, I2S_FLAG_TXURERR)) {
                /* clear underrun flag */
                tmp = SPI_STAT((i2s)->periph);

                i2s->state = HAL_I2S_STATE_READY;
                i2s->error_code = HAL_I2S_ERROR_UNDERRUN;
                return HAL_ERR_HARDWARE;
            }
        }
        i2s->state = HAL_I2S_STATE_READY;

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_NONE;
    } else {

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      receive amounts of data, poll receive process and completed status, the function is blocking
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2s_receive_poll(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, uint32_t timeout_ms)
{
    uint32_t tmp1 = 0U;
    __IO uint32_t tmp = 0x00U;
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check input parameter */
    if((NULL == i2s) || (NULL == p_buffer) || (0U == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock I2S */
    HAL_LOCK(i2s);

