PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2s.c
    if(HAL_I2S_STATE_READY == i2s->state) {
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph) & (SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN);
        if((tmp1 == I2S_FRAMEFORMAT_DT24B_CH32B) || (tmp1 == I2S_FRAMEFORMAT_DT32B_CH32B)) {
            i2s->rxbuffer.length = (length << 1U);
            i2s->rxbuffer.pos = (length << 1U);
        } else {
            i2s->rxbuffer.length = length;
            i2s->rxbuffer.pos = length;
        }

        i2s->error_code = HAL_ERR_NONE;
        i2s->state = HAL_I2S_STATE_BUSY_RX;

        if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)) {
            /* enable I2S peripheral */
            __HAL_I2S_ENABLE(i2s->periph);
        }

        /* receive data */
        while(i2s->rxbuffer.pos > 0U) {
            tick_start = hal_sys_basetick_count_get();
            while(RESET == _i2s_flag_get(i2s->periph, I2S_FLAG_RBNE)) {
                if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                    if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                        return HAL_ERR_TIMEOUT;
                    }
                }
            }

            if(SET == _i2s_flag_get(i2s->periph, I2S_FLAG_RXORERR)) {
                /* clear overrun error */
                tmp = SPI_DATA(i2s->periph);
                tmp = SPI_STAT(i2s->periph);
                /* set the I2S state ready */
                i2s->state = HAL_I2S_STATE_READY;
                i2s->error_code = HAL_I2S_ERROR_OVERRUN;
                return HAL_ERR_HARDWARE;
            }

            (*p_buffer++) = SPI_DATA(i2s->periph);
            i2s->rxbuffer.pos--;
        }

        i2s->state = HAL_I2S_STATE_READY;

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_NONE;
    } else {

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      transmit amounts of data by interrupt method, the function is non-blocking
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2s_transmit_interrupt(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length,
                                   hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t tmp1 = 0U;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == i2s) || (NULL == p_buffer) || (0U == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock I2S */
    HAL_LOCK(i2s);

    if(i2s->state == HAL_I2S_STATE_READY) {
        i2s->txbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph) & (SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN);

        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)) {
            i2s->txbuffer.length = (length << 1U);
            i2s->txbuffer.pos = (length << 1U);
        } else {
            i2s->txbuffer.length = length;
            i2s->txbuffer.pos = length;
        }
        i2s->i2s_irq.transmit_handler = _i2s_transmit_interrupt;
        i2s->tx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;

        i2s->state = HAL_I2S_STATE_BUSY_TX;

        /* enable TBE and ERR interrupt */
        __HAL_I2S_INT_ENABLE(i2s->periph, I2S_INT_TBE);
        __HAL_I2S_INT_ENABLE(i2s->periph, I2S_INT_ERR);

        if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)) {
            /* enable I2S peripheral */
            __HAL_I2S_ENABLE(i2s->periph);
        }

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_NONE;
    } else {

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      receive amounts of data by interrupt method, the function is non-blocking
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2s_receive_interrupt(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length,
                                  hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t tmp1 = 0U;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == i2s) || (NULL == p_buffer) || (0U == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock I2S */
    HAL_LOCK(i2s);

    if(i2s->state == HAL_I2S_STATE_READY) {
        i2s->rxbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph) & (SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN);

        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)) {
            i2s->rxbuffer.length = (length << 1U);
            i2s->rxbuffer.pos = (length << 1U);
        } else {
            i2s->rxbuffer.length = length;
            i2s->rxbuffer.pos = length;
        }

        i2s->i2s_irq.receive_handler = _i2s_receive_interrupt;
        i2s->rx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;
        i2s->state     = HAL_I2S_STATE_BUSY_RX;

        /* enable RBNE and ERR interrupt */
        __HAL_I2S_INT_ENABLE(i2s->periph, I2S_INT_RBNE);
        __HAL_I2S_INT_ENABLE(i2s->periph, I2S_INT_ERR);

        if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)) {
            /* enable I2S peripheral */
            __HAL_I2S_ENABLE(i2s->periph);
        }

        /* unlock I2S */
        HAL_UNLOCK(i2s);

