PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2s.c
        return HAL_ERR_NONE;
    } else {

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      transmit amounts of data by DMA method, the function is non-blocking
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, details refer to gd32f3x0_hal.h
*/
int32_t hal_i2s_transmit_dma(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length,
                             hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t *p_tmp = NULL;
    uint32_t tmp1 = 0U;
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == i2s) || (NULL == p_buffer) || (0U == length)) {
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock I2S */
    HAL_LOCK(i2s);

    if(HAL_I2S_STATE_READY == i2s->state) {
        i2s->txbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph) & (SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN);
        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)) {
            i2s->txbuffer.length = (length << 1U);
            i2s->txbuffer.pos = (length << 1U);
        } else {
            i2s->txbuffer.length = length;
            i2s->txbuffer.pos = length;
        }
        i2s->state = HAL_I2S_STATE_BUSY_TX;
        /* I2S callback function */
        i2s->tx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;

        /* I2S DMA transmit info*/
        hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
        dma_irq.half_finish_handle = NULL;
        dma_irq.full_finish_handle = _i2s_transmit_complete_dma;
        dma_irq.error_handle = _i2s_dma_error;
        p_tmp = (uint32_t *)&p_buffer;
        hal_dma_start_interrupt(i2s->p_dma_tx, *(uint32_t *)p_tmp, (uint32_t)&SPI_DATA(i2s->periph), length, &dma_irq);

        /* enable I2S peripheral */
        __HAL_I2S_ENABLE(i2s->periph);

        /* enable transmit DMA request */
        __HAL_I2S_DMA_ENABLE(i2s->periph, SPI_DMA_TRANSMIT);

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_NONE;
    } else {

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      receive amounts of data by DMA method, the function is non-blocking
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer
    \param[in]  length: length of data to be sent
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_i2s_receive_dma(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length,
                            hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t *p_tmp = NULL;
    __IO uint32_t tmp1 = 0U;
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == i2s) || (NULL == p_buffer) || (0U == length)) {
        return  HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* lock I2S */
    HAL_LOCK(i2s);

    if(HAL_I2S_STATE_READY == i2s->state) {
        i2s->rxbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph) & (SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN);

        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) ||
                (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)) {
            i2s->rxbuffer.length = (length << 1U);
            i2s->rxbuffer.pos = (length << 1U);
        } else {
            i2s->rxbuffer.length = length;
            i2s->rxbuffer.pos = length;
        }

        i2s->state = HAL_I2S_STATE_BUSY_RX;

        /* I2S callback function */
        i2s->rx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;

        /* I2S DMA receive info*/
        hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
        dma_irq.half_finish_handle = NULL;
        dma_irq.full_finish_handle = _i2s_receive_complete_dma;
        dma_irq.error_handle = _i2s_dma_error;
        p_tmp = (uint32_t *)&p_buffer;
        hal_dma_start_interrupt(i2s->p_dma_rx, (uint32_t)&SPI_DATA(i2s->periph), *(uint32_t *)p_tmp, length, &dma_irq);

        __HAL_I2S_ENABLE(i2s->periph);
        /* enable receive DMA request */
        __HAL_I2S_DMA_ENABLE(i2s->periph, SPI_DMA_RECEIVE);

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_NONE;
    } else {

        /* unlock I2S */
        HAL_UNLOCK(i2s);

        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      I2S interrupt handler content function,which is merely used in i2s_handler
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_irq(hal_i2s_dev_struct *i2s)
{
    __IO uint32_t tmp = 0x00U;
    hal_i2s_user_cb p_func;

#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(HAL_I2S_STATE_BUSY_RX == i2s->state) {
        if(RESET != _i2s_interrupt_flag_get(i2s->periph, I2S_INT_FLAG_RBNE)) {
            i2s->i2s_irq.receive_handler(i2s);
        }

        /* I2S overrun error interrupt occured */
        if(RESET != _i2s_interrupt_flag_get(i2s->periph, I2S_INT_FLAG_RXORERR)) {
            /* disable RBNE and ERR interrupt */
            __HAL_I2S_INT_DISABLE(i2s->periph, I2S_INT_RBNE);
            __HAL_I2S_INT_DISABLE(i2s->periph, I2S_INT_ERR);

            /* clear overrun error */
            tmp = SPI_DATA(i2s->periph);
            tmp = SPI_STAT(i2s->periph);

            i2s->state = HAL_I2S_STATE_READY;
            /* set the error code and execute error callback */
            i2s->error_code = HAL_I2S_ERROR_OVERRUN;
            p_func = (hal_i2s_user_cb)i2s->error_callback;
            if(NULL != p_func) {
                p_func(i2s);
            }
        }
    }

