PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2s.c
    if(HAL_I2S_STATE_BUSY_TX == i2s->state) {
        if(RESET != _i2s_interrupt_flag_get(i2s->periph, I2S_INT_FLAG_TBE)) {
            i2s->i2s_irq.transmit_handler(i2s);
        }

        /* I2S underrun error interrupt occurred */
        if(RESET != _i2s_interrupt_flag_get(i2s->periph, I2S_INT_FLAG_TXURERR)) {
            /* disable TBE and ERR interrupt */
            __HAL_I2S_INT_DISABLE(i2s->periph, I2S_INT_TBE);
            __HAL_I2S_INT_DISABLE(i2s->periph, I2S_INT_ERR);

            /* clear underrun flag */
            tmp = SPI_STAT((i2s)->periph);

            i2s->state = HAL_I2S_STATE_READY;
            /* set the error code and execute error callback */
            i2s->error_code = HAL_I2S_ERROR_UNDERRUN;
            p_func = (hal_i2s_user_cb)i2s->error_callback;
            if(NULL != p_func) {
                p_func(i2s);
            }
        }
    }
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to I2S interrupt callback function pointer structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: the corresponding callback mechanism is out of use, and
                     disable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_i2s_irq_handle_set(hal_i2s_dev_struct *i2s, hal_i2s_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(NULL != p_irq->error_handle) {
        i2s->i2s_irq.error_handle = p_irq->error_handle;
        __HAL_I2S_INT_ENABLE(i2s->periph, I2S_INT_ERR);
    } else {
        i2s->i2s_irq.error_handle = NULL;
        __HAL_I2S_INT_DISABLE(i2s->periph, I2S_INT_ERR);
    }

    if(NULL != p_irq->receive_handler) {
        i2s->i2s_irq.receive_handler = p_irq->receive_handler;
        __HAL_I2S_INT_ENABLE(i2s->periph, I2S_INT_RBNE);
    } else {
        i2s->i2s_irq.receive_handler = NULL;
        __HAL_I2S_INT_DISABLE(i2s->periph, I2S_INT_RBNE);
    }

    if(NULL != p_irq->transmit_handler) {
        i2s->i2s_irq.transmit_handler = p_irq->transmit_handler;
        __HAL_I2S_INT_ENABLE(i2s->periph, I2S_INT_TBE);
    } else {
        i2s->i2s_irq.transmit_handler = NULL;
        __HAL_I2S_INT_DISABLE(i2s->periph, I2S_INT_TBE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_irq_handle_all_reset(hal_i2s_dev_struct *i2s)
{
    i2s->i2s_irq.error_handle = NULL;
    i2s->i2s_irq.transmit_handler = NULL;
    i2s->i2s_irq.receive_handler = NULL;
}

/*!
    \brief      start I2S module function
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_start(hal_i2s_dev_struct *i2s)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    __HAL_I2S_ENABLE(i2s->periph);
}

/*!
    \brief      stop I2S module function
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_stop(hal_i2s_dev_struct *i2s)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    __HAL_I2S_DISABLE(i2s->periph);
}

/*!
    \brief      pause I2S DMA
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_dma_pause(hal_i2s_dev_struct *i2s)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(HAL_I2S_STATE_BUSY_TX == i2s->state) {
        /* disable the I2S DMA transmit request */
        __HAL_I2S_DMA_DISABLE(i2s->periph, SPI_DMA_TRANSMIT);
    } else {
        if(HAL_I2S_STATE_BUSY_RX == i2s->state) {
            /* disable the I2S DMA receive request */
            __HAL_I2S_DMA_DISABLE(i2s->periph, SPI_DMA_RECEIVE);
        }
    }
}

/*!
    \brief      II2S DMA resume function
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_dma_resume(hal_i2s_dev_struct *i2s)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

