PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_i2s.c
    if(HAL_I2S_STATE_BUSY_TX == i2s->state) {
        /* disable the I2S DMA transmit request */
        __HAL_I2S_DMA_ENABLE(i2s->periph, SPI_DMA_TRANSMIT);
    } else {
        if(HAL_I2S_STATE_BUSY_RX == i2s->state) {
            /* disable the I2S DMA receive request */
            __HAL_I2S_DMA_ENABLE(i2s->periph, SPI_DMA_RECEIVE);
        }
    }

    if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)) {
        /* enable I2S peripheral */
        __HAL_I2S_ENABLE(i2s->periph);
    }
}

/*!
    \brief      I2S DMA stop function
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_dma_stop(hal_i2s_dev_struct *i2s)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == i2s) {
        HAL_DEBUGE("parameter [*i2s] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    if(HAL_I2S_STATE_BUSY_TX == i2s->state) {
        /* disable the I2S DMA transmit request */
        __HAL_I2S_DMA_DISABLE(i2s->periph, SPI_DMA_TRANSMIT);

        /* disable the I2S DMA channel */
        hal_dma_stop(i2s->p_dma_tx);
    } else {
        if(HAL_I2S_STATE_BUSY_RX == i2s->state) {
            /* disable the I2S DMA receive request */
            __HAL_I2S_DMA_DISABLE(i2s->periph, SPI_DMA_RECEIVE);

            /* disable the I2S DMA channel */
            hal_dma_stop(i2s->p_dma_rx);
        }
    }
    /* disable I2S peripheral */
    __HAL_SPI_DISABLE(i2s->periph);
    i2s->state = HAL_I2S_STATE_READY;
}

/*!
    \brief      reset I2S
    \param[in]  i2s_periph: SPI0
    \param[out] none
    \retval     none
*/
static void _i2s_deinit(uint32_t i2s_periph)
{
    /* reset I2S0 */
    hal_rcu_periph_reset_enable(RCU_SPI0RST);
    hal_rcu_periph_reset_disable(RCU_SPI0RST);
}

/*!
    \brief      I2S DMA transmit handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _i2s_transmit_complete_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2s_dev_struct *p_i2s;
    hal_i2s_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_i2s = (hal_i2s_dev_struct *)p_dma->p_periph;
    p_func = (hal_i2s_user_cb)p_i2s->tx_callback;
    /* DMA normal mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        __HAL_I2S_DMA_DISABLE(p_i2s->periph, SPI_DMA_TRANSMIT);
        p_i2s->txbuffer.length = 0;
        p_i2s->state = HAL_I2S_STATE_READY;
    }
    /* DMA transmit complete callback */
    if(NULL != p_func) {
        p_func(p_i2s);
    }
}

/*!
    \brief      I2S DMA receive handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _i2s_receive_complete_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2s_dev_struct *p_i2s;
    hal_i2s_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_i2s = (hal_i2s_dev_struct *)p_dma->p_periph;
    p_func = (hal_i2s_user_cb)p_i2s->rx_callback;
    /* DMA normal mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        __HAL_I2S_DMA_DISABLE(p_i2s->periph, SPI_DMA_RECEIVE);
        p_i2s->rxbuffer.length = 0;
        p_i2s->state = HAL_I2S_STATE_READY;
    }
    /* DMA receive complete callback */
    if(NULL != p_func) {
        p_func(p_i2s);
    }
}

/*!
    \brief      I2S DMA communication error
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _i2s_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2s_dev_struct *p_i2s;
    hal_i2s_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_i2s = (hal_i2s_dev_struct *)p_dma->p_periph;
    p_func = (hal_i2s_user_cb)p_i2s->error_callback;

    /* disable SPI transmit and receive DMA */
    __HAL_I2S_DMA_DISABLE(p_i2s->periph, SPI_DMA_RECEIVE);
    __HAL_I2S_DMA_DISABLE(p_i2s->periph, SPI_DMA_TRANSMIT);
    p_i2s->txbuffer.length = 0;
    p_i2s->rxbuffer.length = 0;
    p_i2s->state = HAL_I2S_STATE_READY ;

    /* error callback */
    if(NULL != p_func) {
        p_func(p_i2s);
    }
}

/*!
    \brief      I2S transmit interrupt handler
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2s_transmit_interrupt(void *i2s)
{
    hal_i2s_dev_struct *p_i2s = i2s;
    hal_i2s_user_cb p_func = (hal_i2s_user_cb)p_i2s->tx_callback;
    /* transmit data */
    SPI_DATA(p_i2s->periph) = (*p_i2s->txbuffer.buffer++);
    p_i2s->txbuffer.pos--;

    if(0U == p_i2s->txbuffer.pos) {
        /* disable TBE and ERR interrupt */
        __HAL_I2S_INT_DISABLE(p_i2s->periph, I2S_INT_TBE);
        __HAL_I2S_INT_DISABLE(p_i2s->periph, I2S_INT_ERR);
        p_i2s->state = HAL_I2S_STATE_READY;

        if(NULL != p_func) {
            p_func(p_i2s);
        }
    }
}

/*!
    \brief      I2S receive interrupt handler
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2s_receive_interrupt(void *i2s)
{
    hal_i2s_dev_struct *p_i2s = i2s;
    hal_i2s_user_cb p_func = (hal_i2s_user_cb)p_i2s->rx_callback;

    /* receive data */
    (*p_i2s->rxbuffer.buffer++) = SPI_DATA(p_i2s->periph);
    p_i2s->rxbuffer.pos--;

    if(0U == p_i2s->rxbuffer.pos) {
        /* disable RBNE and ERR interrupt */
        __HAL_I2S_INT_DISABLE(p_i2s->periph, I2S_INT_RBNE);
        __HAL_I2S_INT_DISABLE(p_i2s->periph, I2S_INT_ERR);

        p_i2s->state = HAL_I2S_STATE_READY;

        if(NULL != p_func) {
            p_func(p_i2s);
        }
    }
}

/*!
    \brief      get I2S flag status
    \param[in]  spi_periph: SPI0
    \param[in]  flag: I2S flag status
                only one parameter can be selected which are shown as below:
      \arg        I2S_FLAG_TBE: transmit buffer empty flag
      \arg        I2S_FLAG_RBNE: receive buffer not empty flag
      \arg        I2S_FLAG_TRANS: transmit on-going flag
      \arg        I2S_FLAG_RXORERR: overrun error flag
      \arg        I2S_FLAG_TXURERR: underrun error flag
      \arg        I2S_FLAG_CH: channel side flag
      \arg        I2S_FLAG_FERR: I2S format error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
static FlagStatus _i2s_flag_get(uint32_t periph, uint32_t flag)
{
    if(RESET != (SPI_STAT(periph) & flag)) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      get I2S interrupt flag status
    \param[in]  spi_periph: SPI0
    \param[in]  interrupt: I2S interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        I2S_INT_FLAG_TBE: transmit buffer empty interrupt flag
      \arg        I2S_INT_FLAG_RBNE: receive buffer not empty interrupt flag
      \arg        I2S_INT_FLAG_RXORERR: overrun interrupt flag
      \arg        I2S_INT_FLAG_TXURERR: underrun error interrupt flag
      \arg        I2S_INT_FLAG_FERR: format error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
static FlagStatus _i2s_interrupt_flag_get(uint32_t periph, uint8_t interrupt)
{
    uint32_t reg1 = SPI_STAT(periph);
    uint32_t reg2 = SPI_CTL1(periph);

    switch(interrupt) {
    /* I2S transmit buffer empty interrupt */
    case I2S_INT_FLAG_TBE:
        reg1 = reg1 & SPI_STAT_TBE;
        reg2 = reg2 & SPI_CTL1_TBEIE;
        break;
    /* I2S receive buffer not empty interrupt */
    case I2S_INT_FLAG_RBNE:
        reg1 = reg1 & SPI_STAT_RBNE;
        reg2 = reg2 & SPI_CTL1_RBNEIE;
        break;
    /* I2S overrun interrupt */
    case I2S_INT_FLAG_RXORERR:
        reg1 = reg1 & SPI_STAT_RXORERR;
        reg2 = reg2 & SPI_CTL1_ERRIE;
        break;
    /* I2S underrun error interrupt */
    case I2S_INT_FLAG_TXURERR:
        reg1 = reg1 & SPI_STAT_TXURERR;
        reg2 = reg2 & SPI_CTL1_ERRIE;
        break;
    /* I2S format error interrupt */
    case I2S_INT_FLAG_FERR:
        reg1 = reg1 & SPI_STAT_FERR;
        reg2 = reg2 & SPI_CTL1_ERRIE;
        break;
    default :
        break;
    }
    /*get I2S interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        return SET;
    } else {
        return RESET;
    }
}
#endif /* GD32F350 and GD32F310 */
